{
  "profileAltText": "John Fredy Quimbaya Orozco",
  "nameProfile": "John Fredy Quimbaya Orozco",
  "titleProfile": "Ingeniero de Sistemas, Especialista en Ingeniería de Software, Arquitecto de Software y Líder Técnico.",
  "descriptionProfile": "Conocimiento en lenguajes de programación como Java, C# y JavaScript. Con experiencia en frameworks como ASP.NET, .NET Core y Angular, Spring Boot, En bases de datos como SQL Server, Oracle y Mongodb. Familiarizado con AWS y las metodologías Scrum.",
  "profileProfessional": "Perfil Profesional",
  "profileRole": "Arquitecto de Soluciones y Líder Técnico",
  "profileParagraph1": "Cuento con una formación consolidada en <strong>Ingeniería de Sistemas</strong> y una vasta trayectoria en el diseño, desarrollo e implementación de soluciones informáticas, especialmente en sectores críticos como finanzas y salud. Además, tengo habilidades destacadas en la gestión de proveedores y en el seguimiento y control de proyectos informáticos.",
  "profileParagraph2": "Como <strong>Coordinador Nacional de Desarrollo en Coomeva</strong>, lideré con éxito un equipo multidisciplinario de 8 ingenieros en proyectos de alta complejidad. Esto fortaleció mis habilidades en gestión de proyectos y liderazgo técnico.",
  "profileParagraph3": "Actualmente, curso una <strong>Maestría en Ingeniería de Software</strong> y otra en <strong>Gerencia en Tecnologías de Información</strong>, lo que me permite mantenerme a la vanguardia de las tendencias tecnológicas y las mejores prácticas en arquitectura de software.",
  "profileParagraph4": "Mi trayectoria se caracteriza por la aplicación de diversos paradigmas de software, un sólido conocimiento en arquitectura y la habilidad para entregar soluciones efectivas y robustas.",
  "workExperience": "DESARROLLADOR FREELANCE",
  "workExperienceTitle": "Experiencia Laboral",
  "exsisExperienceTitle": "CONSULTOR SENIOR •Tiempo: 1 Año•",
  "exsisExperienceDescription": "En mi papel como Consultor Senior en Exsis Digital, fui una parte integral del equipo de vulnerabilidades. Mis responsabilidades principales incluyeron abordar las actualizaciones de aplicaciones y frameworks de la empresa. Este trabajo se llevó a cabo principalmente utilizando lenguajes como C#, Asp.Net, jQuery y JavaScript. A través de este rol, contribuí de manera efectiva al mantenimiento y mejora de nuestra infraestructura de software, asegurando su rendimiento óptimo y estabilidad. Logramos solventar el 95% de las vulnerabilidades de alto impacto y el 60% de las de bajo impacto. Esta posición me permitió enfocar mis habilidades técnicas en la resolución de desafíos complejos de software, mientras colaboraba estrechamente con otros equipos para garantizar la seguridad y eficacia de las soluciones implementadas.",
  "coomevaExperienceTitle": "Coordinador de Desarrollo de software •Tiempo: 4 Años•",
  "coomevaExperienceDescription": "En mi papel como Coordinador Nacional de Desarrollo en Coomeva Medicina Prepagada, tuve el honor de liderar y proporcionar orientación técnica a un equipo de ingenieros altamente talentosos. Juntos, navegamos a través de todas las etapas del ciclo de vida del desarrollo de software.\n\nNos destacamos en la implementación de tecnologías punteras como Java, Angular y PHP para diseñar y desarrollar soluciones personalizadas que atendieran las necesidades tanto de nuestros clientes internos como externos. Como parte de mis responsabilidades principales, estuve a cargo de definir y supervisar la arquitectura de estas soluciones, asegurando su alineación con los objetivos estratégicos y las normativas tecnológicas de la organización.\n\nMediante una gestión efectiva y una colaboración cercana con el equipo, logramos con éxito implementar y modernizar nuestra aplicación empresarial principal, marcando un hito significativo en nuestro proceso de transformación digital. Este proyecto resalta no solo mi capacidad para liderar y ejecutar proyectos de alta complejidad, sino también mi habilidad para diseñar arquitecturas sólidas que faciliten la evolución y el mantenimiento a largo plazo del software.\n\nAdicionalmente, lideré la creación e implementación de integraciones robustas con APIs Rest en Java para nuestros sistemas satélite. Esta iniciativa mejoró de manera significativa la conectividad del sistema y optimizó la eficiencia en el flujo de datos en toda la organización.\n\nTambién cabe destacar un proyecto en el que mejoramos la aplicación de recaudos en línea en un 90%. Anteriormente, los usuarios experimentaban largos tiempos de espera en la aplicación de los recaudos, y esta iniciativa resolvió este problema de manera efectiva.\n\nEstas experiencias han reforzado mi competencia en la creación y gestión de arquitecturas tecnológicas. Me siento preparado para enfrentar desafíos aún más grandes en roles de Arquitecto y Líder Técnico, donde mi capacidad para diseñar soluciones escalables y mantener equipos altamente productivos será de un valor incalculable.",
  "cinteExperienceTitle": "Desarrollador FullStack •Tiempo: 8 Meses•",
  "cinteExperienceDescription": "Durante mi tiempo en Cinte, ocupé el puesto de Desarrollador Full Stack. Mis responsabilidades incluyeron la creación y gestión de microservicios utilizando bases de datos MongoDB, así como la contribución a la implementación de nuevas características y funcionalidades en el proyecto. Mi enfoque principal se centró en garantizar la eficiencia de los desarrollos, lo que resultó en la puesta en producción de funcionalidades que permitieron a la organización alinear su estrategia con los objetivos del mercado, generando así un valor significativo para la empresa y asegurando que las soluciones propuestas cumplieran con los estándares de calidad y los objetivos comerciales.",
  "novatecExperienceTitle": "Arquitecto de Software •Tiempo: 2 Meses•",
  "novatecExperienceDescription": "Durante mi tiempo en Novatec, ocupé el cargo de Arquitecto de Software. Mi principal responsabilidad consistió en liderar y definir la arquitectura de los microservicios para el proyecto \"App Móvil\". Esta posición me brindó la oportunidad de profundizar en el diseño y la planificación de sistemas escalables y sólidos, asegurando la eficiencia y la calidad de las soluciones tecnológicas implementadas para nuestros clientes.",
  "taylorandJohnsonExperienceTitle": "Desarrollador de Software •Tiempo: 2 Años•",
  "taylorandJohnsonExperienceDescription": "Como Desarrollador de Software en Johnson & Taylor, mi enfoque principal se centró en el diseño y desarrollo de soluciones especializadas para los sectores financiero y de salud. Durante mi tiempo en el equipo de desarrollo, desempeñé un rol fundamental en la creación de soluciones estratégicas que abordaban diversas necesidades empresariales.\n\nUno de los logros más destacados de mi carrera en esta posición fue la concepción y desarrollo del sistema Generador Contable. Este sistema, esencial para nuestras operaciones comerciales centrales, se integró de manera fluida con Oracle EBS. Este proyecto de gran envergadura se desarrolló utilizando tecnologías de vanguardia como C# Asp.Net y SQL Server, lo que representó un paso significativo en la mejora de nuestra eficiencia operativa y nuestras capacidades de gestión de datos.\n\nMi experiencia y logros en Johnson & Taylor reflejan mi capacidad para abordar proyectos desafiantes y crear soluciones tecnológicas que tienen un impacto real en la eficiencia y el éxito empresarial. Estoy emocionado por la oportunidad de aportar estas habilidades y logros a un nuevo desafío en mi carrera.",
  "freelanceExperienceTitle": "Desarrollador de Software •8 Meses•",
  "freelanceExperienceDescription": "Durante mi período como freelancer, residí en Chile, lo que me brindó la oportunidad de disfrutar de tiempo de calidad con mi familia paterna. A lo largo de esos meses, me involucré en varios proyectos, aunque algunos de ellos no llegaron a concretarse. Sin embargo, este tiempo fue una excelente oportunidad para dedicarme al aprendizaje y la capacitación. Invertí horas en plataformas educativas como Platzi y Udemy, donde me sumergí en el mundo del desarrollo de software. Soy una persona sumamente dedicada y enfocada, lo que me permitió adquirir y fortalecer habilidades en lenguajes de programación como Java, C# y JavaScript, así como mejorar mi competencia en bases de datos relacionales.",
  "educationTitle": "Formación Académica",
  "education1Title": "Ingeniería de Sistemas",
  "education1Date": "Universidad Cooperativa de Colombia - Fecha: 09-12-2016",
  "education2Title": "Especialización en Ingeniería de Software",
  "education2Date": "Universidad Javeriana Cali - Fecha: 12-09-2022",
  "education3Title": "Maestría en Ingeniería de Software",
  "education3Date": "Universidad Javeriana Cali - Trabajo de grado",
  "education4Title": "Maestría Gerencia en Tecnologías de la Información",
  "education4Date": "Universidad Icesi - Trabajo de grado",
  "cursosScrum": "Metodologías Agiles ",
  "certificateTitle": "Certificación",
  "courseTitle": "Cursos y Capacitaciones",
  "courseDescription": "Desarrollo Integral de Aplicaciones Web: Backend y Frontend",
  "course2Description": "En mi trayectoria educativa virtual en plataformas como Platzi, Linkedin Learning, Udemy, Codelypro, he forjado un amplio conjunto de habilidades en el campo del desarrollo de software. Mi formación abarca tanto el desarrollo frontend como el backend, lo que me brinda una visión completa del ciclo de desarrollo de aplicaciones.\n\nHe adquirido competencias sólidas en diversos lenguajes de programación, incluyendo Java, C#, y JavaScript. Esta diversidad me permite abordar proyectos desde múltiples perspectivas y elegir las tecnologías más adecuadas para cada situación.\n\nAdicionalmente, he profundizado en el uso de frameworks como Laravel y Angular, lo que me capacita para crear aplicaciones web sólidas y de alto rendimiento. También he obtenido experiencia en el modelado de bases de datos, tanto relacionales como no relacionales, lo que me habilita para diseñar sistemas de información eficientes y escalables.\n\nPuedes encontrar mis logros y certificaciones en detalle en mi perfil de las diferentes plataformas en las urls al final, lo que refleja mi compromiso con el aprendizaje continuo y el desarrollo de habilidades relevantes en el ámbito tecnológico. Estoy entusiasmado por aplicar estas habilidades en proyectos desafiantes y contribuir al éxito de mi próximo equipo y empresa.\n",
  "courseInformationSocial": "Redes Sociales",
  "courseInformationContac": "Información de Contacto",
  "cajaMoreliaExperienceTitle": "Arquitecto de Software •Tiempo: Actualmente•",
  "cajaMoreliaExperienceDescription": "En mi rol como Arquitecto de Software en el proyecto de Koralat, tengo la responsabilidad de dirigir la implementación de la arquitectura propuesta. Entre mis actividades se encuentran promover la adopción de patrones arquitectónicos como el hexagonal y el Domain-Driven Design, así como la implementación de contenedores y arquitecturas distribuidas, incluyendo la arquitectura Event-Driven. Utilizamos bases de datos SQL Server y lenguajes como C#, ASP.NET, .NET Core, y Vue.js para las integraciones con aplicaciones frontend, lo que nos permite desarrollar arquitecturas basadas en servicios robustas y escalables. Mi liderazgo es fundamental para asegurar la aplicación efectiva de estos patrones establecidos."
}
