{
  "profileAltText": "John Fredy Quimbaya Orozco",
  "nameProfile": "John Fredy Quimbaya Orozco",
  "titleProfile": "Systems Engineer, Specialist in Software Engineering, Software Architect, and Technical Leader.",
  "descriptionProfile": "Proficient in programming languages such as Java, C#, and JavaScript. Experienced with frameworks like ASP.NET, .NET Core, Angular, and Spring Boot, as well as databases like SQL Server, Oracle and MongoDB. Familiar with AWS and Scrum methodologies.",
  "profileProfessional": "Professional Profile",
  "profileRole": "Solutions Architect and Technical Lead",
  "profileParagraph1": "I have a solid education in <strong>Systems Engineering</strong> and a vast experience in the design, development, and implementation of IT solutions, especially in critical sectors such as finance and health. Moreover, I possess outstanding skills in supplier management and in the monitoring and control of IT projects.",
  "profileParagraph2": "As the <strong>National Development Coordinator at Coomeva</strong>, I successfully led a multidisciplinary team of 8 engineers on high-complexity projects. This strengthened my skills in project management and technical leadership.",
  "profileParagraph3": "Currently, I'm pursuing a <strong>Master's in Software Engineering</strong> and another in <strong>Information Technology Management</strong>, which allows me to stay at the forefront of technological trends and best practices in software architecture.",
  "profileParagraph4": "My career is characterized by the application of various software paradigms, a deep knowledge in architecture, and the ability to deliver effective and robust solutions.",
  "workExperience": "FREELANCE DEVELOPER",
  "workExperienceTitle": "Work experience",
  "exsisExperienceTitle": "SENIOR CONSULTANT •Duration: 1 Year•",
  "exsisExperienceDescription": "In my role as a Senior Consultant at Exsis Digital, I was an integral part of the vulnerabilities team. My main responsibilities included addressing application and company framework updates. This work was primarily carried out using languages such as C#, Asp.Net, jQuery, and JavaScript. Through this role, I effectively contributed to the maintenance and improvement of our software infrastructure, ensuring its optimal performance and stability. We were able to resolve 95% of high vulnerabilities and 60% of low vulnerabilities. This position allowed me to apply my technical skills to solving complex software challenges while closely collaborating with other teams to ensure the security and effectiveness of implemented solutions.",
  "coomevaExperienceTitle": "Software Development Coordinator • Duration: 4 Years •",
  "coomevaExperienceDescription": "In my role as National Development Coordinator at Coomeva Medicina Prepagada, I had the privilege of leading and providing technical guidance to a highly talented team of engineers. Together, we navigated through all stages of the software development life cycle.\n\nWe excelled in implementing cutting-edge technologies such as Java, Angular, and PHP to design and develop customized solutions that addressed the needs of both our internal and external clients. As part of my primary responsibilities, I was responsible for defining and overseeing the architecture of these solutions, ensuring their alignment with the organization's strategic objectives and technological standards. Through effective management and close collaboration with the team, we successfully implemented and modernized our core business application, marking a significant milestone in our digital transformation journey. This project highlights not only my ability to lead and execute high-complexity projects but also my skill in designing robust architectures that facilitate long-term software evolution and maintenance.\n\nAdditionally, I led the creation and implementation of robust integrations with Java-based RESTful APIs for our satellite systems. This initiative significantly improved system connectivity and optimized data flow efficiency throughout the organization.\n\nIt's also worth noting a project in which we improved online revenue collection by 90%. Previously, users experienced long wait times in the revenue collection application, and this initiative effectively resolved this issue.\n\nThese experiences have strengthened my competence in creating and managing technological architectures. I am prepared to take on even greater challenges in roles as an Architect and Technical Leader, where my ability to design scalable solutions and maintain highly productive teams will be of immeasurable value.",
  "cinteExperienceTitle": "FullStack Developer • Duration: 8 Months •",
  "cinteExperienceDescription": "During my time at Cinte, I held the position of Full Stack Developer. My responsibilities included creating and managing microservices using MongoDB databases, as well as contributing to the implementation of new features and functionalities in the project. My primary focus was on ensuring the efficiency of the developments, resulting in the production deployment of features that allowed the organization to align its strategy with market objectives, generating significant value for the company, and ensuring that the proposed solutions met quality standards and business objectives.",
  "novatecExperienceTitle": "Software Architect • Duration: 2 Months •",
  "novatecExperienceDescription": "During my time at Novatec, I held the role of Software Architect. My main responsibility was to lead and define the architecture of microservices for the \"Mobile App\" project. This role allowed me to delve into the design and planning of scalable and robust systems, ensuring efficiency and quality in the technological solutions implemented for our clients.",
  "taylorandJohnsonExperienceTitle": "Software Developer • Duration: 2 Years •",
  "taylorandJohnsonExperienceDescription": "In my role as a Software Developer at Johnson & Taylor, my primary focus was on designing and developing specialized solutions for the financial and healthcare sectors. During my time on the development team, I played a pivotal role in conceiving strategic solutions that addressed various business needs.\n\nOne of the most notable achievements in my career in this position was the conception and development of the Accounting Generator system. This system, essential to our core business operations, seamlessly integrated with Oracle EBS. This large-scale project was developed using cutting-edge technologies like C# Asp.Net and SQL Server, representing a significant step forward in improving our operational efficiency and data management capabilities.\n\nMy experience and accomplishments at Johnson & Taylor showcase my ability to tackle challenging projects and create technological solutions that have a real impact on efficiency and business success. I am excited about the opportunity to bring these skills and achievements to a new career challenge.\n\n\n\n\n\n",
  "freelanceExperienceTitle": "Software Developer • 8 Months •",
  "freelanceExperienceDescription": "During my time as a freelancer, I resided in Chile, which provided me with the opportunity to enjoy quality time with my paternal family. Throughout those months, I got involved in various projects, although some of them didn't come to fruition. However, this time was an excellent opportunity for me to dedicate myself to learning and training. I invested hours in educational platforms like Platzi and Udemy, where I immersed myself in the world of software development. I am an extremely dedicated and focused individual, which allowed me to acquire and strengthen skills in programming languages such as Java, C#, and JavaScript, as well as improve my proficiency in relational databases.",
  "educationTitle": "Educational Background",
  "education1Title": "Systems Engineering",
  "education1Date": "Universidad Cooperativa de Colombia - Date: 09-12-2016",
  "education2Title": "Software Engineering Specialization",
  "education2Date": "Javeriana University Cali - Date: 12-09-2022",
  "education3Title": "Master's in Software Engineering",
  "education3Date": "Javeriana University Cali - Currently: Graduation Project",
  "education4Title": "Master of Information Technology Management",
  "education4Date": "Icesi University - Currently: Graduation Project",
  "cursosScrum": "Agile Methodologies",
  "certificateTitle": "Certification",
  "courseTitle": "Training and Courses",
  "courseDescription": "Comprehensive Web Application Development - Backend and Frontend",
  "course2Description": "In my virtual educational journey on platforms such as Platzi, LinkedIn Learning, Udemy, CodeLyPro, I have forged a wide range of skills in the field of software development. My training covers both frontend and backend development, providing me with a comprehensive understanding of the application development lifecycle.\n\nI have gained strong competencies in various programming languages, including Java, C#, and JavaScript. This diversity enables me to approach projects from multiple perspectives and choose the most suitable technologies for each situation.\n\nAdditionally, I have delved into the use of frameworks such as Laravel and Angular, equipping me to create robust and high-performance web applications. I have also gained experience in database modeling, both relational and non-relational, enabling me to design efficient and scalable information systems.\n\nYou can find my achievements and certifications in detail on my profiles across different platforms at the provided URLs, which reflect my commitment to continuous learning and the development of relevant skills in the tech industry. I am excited to apply these skills to challenging projects and contribute to the success of my next team and company.",
  "courseInformationSocial": "Social Networks",
  "courseInformationContac": "Contact Information"
}